<?php
// +---------------------------------------------------------------------+
// | OneBase    | [ WE CAN DO IT JUST THINK ]                            |
// +---------------------------------------------------------------------+
// | Licensed   | http://www.apache.org/licenses/LICENSE-2.0 )           |
// +---------------------------------------------------------------------+
// | Author     | Bigotry <3162875@qq.com>                               |
// +---------------------------------------------------------------------+
// | Repository | https://gitee.com/Bigotry/OneBase                      |
// +---------------------------------------------------------------------+
// 绑定前台模块
define('BIND_MODULE', 'index');
// 如果静态文件不存在则访问动态文件

if(!file_exists($_SERVER['REQUEST_URI']) || $_SERVER['REQUEST_URI'] == '/'){
	// 加载公共引导文件
	require './public.php';
}


